app/Controllers/UtilisateurController.php

SELECT *
FROM `utilisateur`
 LIMIT 1
---
    public function login(): string
    {
        return view('login/login', [
            'firstUser' => $this->utilisateurModel->first(),
        ]);