app/Controllers/UtilisateurController.php

SELECT *
FROM `utilisateur`
 LIMIT 1
---
    public function login(): string
    {
        return view('login/login', [
            'firstUser' => $this->utilisateurModel->first(),
        ]);

SELECT *
FROM `utilisateur`
WHERE `utilisateur`.`id` = 1
---
    public function profil()
    {
        if (!session()->get('is_logged')) {
            return redirect()->to('/userAuth')
                ->with('error', 'Vous devez être connecté pour accéder à cette page.');
        }

        $userId = session()->get('user_id');
        $user = $this->utilisateurModel->find($userId);