app/Models/RegimeModel.php

SELECT *
FROM `regime`
---
    public function getAllRegimes(): array
    {
        return $this->findAll();

SELECT *
FROM `regime`
WHERE `regime`.`id` = 2
---
    public function getRegimeById(int $id): ?array
    {
        return $this->find($id);