app/Models/SanteUtilisateurModel.php

    public function createSanteInfo(int $id_utilisateur, float $poids, float $taille): int
    {
        $data = [
            'id_utilisateur' => $id_utilisateur,
            'poids' => $poids,
            'taille' => $taille,
            'date_mesure' => date('Y-m-d H:i:s')
        ];
        return $this->insert($data);
---
INSERT INTO `sante_utilisateur` (`id_utilisateur`, `poids`, `taille`, `date_mesure`) VALUES (1, 50, 150, '2026-05-10 11:21:06')

    public function getAllSanteInfoUser(int $id_utilisateur): ?array
    {
        return $this->where('id_utilisateur', $id_utilisateur)
        ->orderBy('date_mesure', 'DESC')
        ->findAll();
---
SELECT *
FROM `sante_utilisateur`
WHERE `id_utilisateur` = 2
ORDER BY `date_mesure` DESC

    public function calculIMC(int $id_utilisateur): ?float
    {
        $data = $this->where('id_utilisateur', $id_utilisateur)->orderBy('date_mesure', 'DESC')->first();
---
SELECT *
FROM `sante_utilisateur`
WHERE `id_utilisateur` = 2
ORDER BY `date_mesure` DESC
 LIMIT 1