app/Models/UtilisateurModel.php

    public function checkUser(string $nom, string $mot_de_passe): ?array
    {
        $user = $this->where('nom', $nom)->first();
---
SELECT *
FROM `utilisateur`
WHERE `nom` = 'user'
 LIMIT 1

    public function createUser(string $nom, string $email,string $mot_de_passe, string $genre): int {
        $hashedPassword = password_hash($mot_de_passe, PASSWORD_DEFAULT);
        $data = [
            'nom' => $nom,
            'email' => $email,
            'mot_de_passe' => $hashedPassword,
            'genre' => $genre,
            'date_inscription' => date('Y-m-d H:i:s'),
            'gold' => 0
        ];
        $inserted = $this->insert($data, true);
        if (!$inserted) {
            return 0;
        }
        $id = $this->getInsertID();

        // auto-create wallet for user
        $portModel = new PortefeuilleModel();
        $portModel->insert(['id_utilisateur' => $id, 'solde' => 0]);
---
INSERT INTO `utilisateur` (`nom`, `email`, `mot_de_passe`, `genre`, `date_inscription`, `gold`) VALUES ('user', 'test@gmail.com', '$2y$12$UrP8gb6VA.cUbwN0N/UC3ec61Mpdbwti2Quqx3kRRoQPxAsE/uQ0C', 'Homme', '2026-05-10 11:21:06', 0)
INSERT INTO `portefeuille` (`id_utilisateur`, `solde`) VALUES (1, 0)

    public function getInfoUser(int $id): ?array
    {

        return $this->select(['nom', 'email', 'genre', 'date_inscription', 'gold'])
                ->where('id', $id)
                ->first();
---
SELECT `nom`, `email`, `genre`, `date_inscription`, `gold`
FROM `utilisateur`
WHERE `id` = 2
 LIMIT 1

    public function updateUtilisateur(int $id, string $nom, string $email, string $genre): bool
    {
        $data = [
            'nom' => $nom,
            'email' => $email,
            'genre' => $genre
        ];
        return $this->update($id, $data);
---
UPDATE `utilisateur` SET `nom` = 'Cristiano Ronaldo', `email` = 'cr7@gmail.com', `genre` = 'Femme'
WHERE `utilisateur`.`id` IN (1)